In [1]:
import pandas as pd
import numpy as np

In [2]:
dcredit = pd.read_csv("german_credit_data.csv")
dcredit.head()

   Unnamed: 0  Age     Sex  ...  Credit amount Duration              Purpose
0           0   67    male  ...           1169        6             radio/TV
1           1   22  female  ...           5951       48             radio/TV
2           2   49    male  ...           2096       12            education
3           3   45    male  ...           7882       42  furniture/equipment
4           4   53    male  ...           4870       24                  car

[5 rows x 10 columns]

In [3]:
dcredit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        1000 non-null   int64
 1   Age               1000 non-null   int64
 2   Sex               1000 non-null   object
 3   Job               1000 non-null   int64
 4   Housing           1000 non-null   object
 5   Saving accounts   817 non-null    object
 6   Checking account  606 non-null    object
 7   Credit amount     1000 non-null   int64
 8   Duration          1000 non-null   int64
 9   Purpose           1000 non-null   object
dtypes: int64(5), object(5)
memory usage: 78.2+ KB

In [4]:
dnew_credit = dcredit.drop(['Unnamed: 0','Checking account', 'Duration', 'Purpose'], axis=1)
dnew_credit.head()

   Age     Sex  Job Housing Saving accounts  Credit amount
0   67    male    2     own             NaN           1169
1   22  female    2     own          little           5951
2   49    male    1     own          little           2096
3   45    male    2    free          little           7882
4   53    male    2    free          little           4870

In [5]:
dnew = dnew_credit.dropna()
dnew.head()

   Age     Sex  Job Housing Saving accounts  Credit amount
1   22  female    2     own          little           5951
2   49    male    1     own          little           2096
3   45    male    2    free          little           7882
4   53    male    2    free          little           4870
6   53    male    2     own      quite rich           2835

In [6]:
from sklearn import preprocessing
le = preprocessing.LabelEncoder()

In [7]:
dnew['JK'] = le.fit_transform(dnew['Sex'])
dnew['House'] = le.fit_transform(dnew['Housing'])
dnew['Sosial'] = le.fit_transform(dnew['Saving accounts'])
dnew.head()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

   Age     Sex  Job Housing Saving accounts  Credit amount  JK  House  Sosial
1   22  female    2     own          little           5951   0      1       0
2   49    male    1     own          little           2096   1      1       0
3   45    male    2    free          little           7882   1      0       0
4   53    male    2    free          little           4870   1      0       0
6   53    male    2     own      quite rich           2835   1      1       2

In [8]:
dnew.to_excel("creditnew.xlsx")

In [9]:
data = pd.read_csv("creditbersih.csv")
data.head()

   Unnamed: 0  Age     Sex  Job  ... Credit amount JK House  Sosial
0           1   22  female    2  ...        tinggi  0     1       0
1           2   49    male    1  ...        rendah  1     1       0
2           3   45    male    2  ...        tinggi  1     0       0
3           4   53    male    2  ...        tinggi  1     0       0
4           6   53    male    2  ...        rendah  1     1       2

[5 rows x 10 columns]

In [10]:
dataa = data.drop(['Unnamed: 0'], axis=1)
dataa.head()

   Age     Sex  Job Housing Saving accounts Credit amount  JK  House  Sosial
0   22  female    2     own          little        tinggi   0      1       0
1   49    male    1     own          little        rendah   1      1       0
2   45    male    2    free          little        tinggi   1      0       0
3   53    male    2    free          little        tinggi   1      0       0
4   53    male    2     own      quite rich        rendah   1      1       2

In [11]:
dataa['Credit'] = le.fit_transform(dataa['Credit amount'])
dataa.head()

   Age     Sex  Job Housing  ... JK House  Sosial  Credit
0   22  female    2     own  ...  0     1       0       1
1   49    male    1     own  ...  1     1       0       0
2   45    male    2    free  ...  1     0       0       1
3   53    male    2    free  ...  1     0       0       1
4   53    male    2     own  ...  1     1       2       0

[5 rows x 10 columns]

In [12]:
dataa.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 817 entries, 0 to 816
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Age              817 non-null    int64
 1   Sex              817 non-null    object
 2   Job              817 non-null    int64
 3   Housing          817 non-null    object
 4   Saving accounts  817 non-null    object
 5   Credit amount    817 non-null    object
 6   JK               817 non-null    int64
 7   House            817 non-null    int64
 8   Sosial           817 non-null    int64
 9   Credit           817 non-null    int64
dtypes: int64(6), object(4)
memory usage: 64.0+ KB

In [13]:
dataa.corr()

             Age       Job        JK     House    Sosial    Credit
Age     1.000000 -0.015036  0.150733 -0.314986  0.037330 -0.016902
Job    -0.015036  1.000000  0.070399 -0.103523 -0.031768  0.241557
JK      0.150733  0.070399  1.000000 -0.191171 -0.005562  0.049174
House  -0.314986 -0.103523 -0.191171  1.000000  0.041994 -0.095612
Sosial  0.037330 -0.031768 -0.005562  0.041994  1.000000 -0.058287
Credit -0.016902  0.241557  0.049174 -0.095612 -0.058287  1.000000

In [14]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.preprocessing import StandardScaler

In [15]:
x = dataa[['Age','Job','JK','House','Sosial']].values

In [16]:
y = dataa['Credit'].values

In [17]:
scaler = StandardScaler()

In [18]:
normal_x = scaler.fit_transform(x)
normal_x

array([[-1.15747673,  0.16106733, -1.45954383, -0.14796669, -0.52548243],
       [ 1.22320198, -1.3690723 ,  0.68514558, -0.14796669, -0.52548243],
       [ 0.87050884,  0.16106733,  0.68514558, -2.03685403, -0.52548243],
       ...,
       [ 0.25329584,  0.16106733,  0.68514558, -0.14796669, -0.52548243],
       [-1.06930344,  0.16106733,  0.68514558, -2.03685403, -0.52548243],
       [-0.7166103 ,  0.16106733,  0.68514558, -0.14796669,  0.62550724]])

In [19]:
X_train, X_test, y_train, y_test = train_test_split(normal_x, y.ravel(), test_size=0.2, random_state=0)

In [20]:
LR = LogisticRegression()
LR.fit(X_train, y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [21]:
from sklearn.metrics import accuracy_score

ypred = LR.predict(x)
print("Akurasi ", accuracy_score(y, ypred))

ypredik = LR.predict(X_test)
print("Akurasi terstandarisasi ", accuracy_score(y_test, ypredik))

Akurasi  0.6634026927784578
Akurasi terstandarisasi  0.676829268292683

In [22]:
print("score train :", LR.score(X_train, y_train))
print("score test :", LR.score(X_test, y_test))

score train : 0.6937212863705973
score test : 0.676829268292683

# **AKURASI UNTUK VARIABEL Y YANG TIDAK DILABELKAN**

In [23]:
x_ = dnew[['Age','Job','JK','House','Sosial']].values 
y_ = dnew['Credit amount'].values

xnormal = scaler.fit_transform(x_)
xnormal

array([[-1.15747673,  0.16106733, -1.45954383, -0.14796669, -0.52548243],
       [ 1.22320198, -1.3690723 ,  0.68514558, -0.14796669, -0.52548243],
       [ 0.87050884,  0.16106733,  0.68514558, -2.03685403, -0.52548243],
       ...,
       [ 0.25329584,  0.16106733,  0.68514558, -0.14796669, -0.52548243],
       [-1.06930344,  0.16106733,  0.68514558, -2.03685403, -0.52548243],
       [-0.7166103 ,  0.16106733,  0.68514558, -0.14796669,  0.62550724]])

In [24]:
X_trainn, X_testt, y_trainn, y_testt = train_test_split(xnormal, y.ravel(), test_size=0.2, random_state=0)

In [29]:
lr = LogisticRegression()
lr.fit(X_trainn, y_trainn)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [30]:
from sklearn.metrics import accuracy_score

ypred1 = lr.predict(x_)
print("Akurasi ", accuracy_score(y_, ypred1))

Akurasi  0.0
Akurasi terstandarisasi  0.676829268292683